services/5.hash-implemementation-redis/load-test.yml
config:
  target: "http://localhost:8120"
  phases:
    - duration: 10
      arrivalRate: 50
      name: "Ramp up load"
  processor: "./src/urlGenerator.js"

scenarios:
  - name: "URL Generation"
    weight: 10
    flow:
      - function: "generateRandomUrl"
      - post:
          url: "/api/shorten"
          json:
            longUrl: "{{ randomUrl }}"
  - name: "URL Retrieval"
    weight: 90
    flow:
      # Step 2: Test redirects
      - function: "getRandomShortUrl"
      - get:
          url: "/{{ randomShortUrl }}"
          followRedirect: false
          expect:
            - statusCode: [301]